# Data Cleaning

## 1. Dataset: Share of Women Inventors

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy import stats

5 Datasets are downloaded before preprocessing in this jupyter notebook:

2 datasets from Max Roser and Esteban Ortiz-Ospina (2013) - "Tertiary Education". Published online at OurWorldInData.org. Retrieved from: 'https://ourworldindata.org/tertiary-education' [Online Resource].

1. gpi-tertiary-education.csv 
2. share-graduates-stem-female.csv

3 datasets from OECD.Stat (https://stats.oecd.org/index.aspx?queryid=83119#).

1. Share_of_women_inventors.csv 
2. Attitude_towards_entrepreneurial_risk_by_sex.csv 
3. Access_to_training_and_money_to_start_a_business_by_sex.csv

In [2]:
#load raw dataset of Share of Women Inventors
share_of_women_inventors = pd.read_csv("share_of_women_inventors.csv")

#get rid of undesired columns
share_of_women_inventors = share_of_women_inventors.drop(columns=['LOCATION','INDICATOR','SEX','Sex','AGE','Age','TIME','Unit Code','PowerCode Code','PowerCode','Reference Period Code','Reference Period','Flag Codes','Flags'])

#merge indicator and value columns to one column
share_of_women_inventors['Share of Women Inventors (%)'] = share_of_women_inventors['Value']

#get rid of the original indicator and value columns
share_of_women_inventors = share_of_women_inventors.drop(columns=['Indicator','Value'])

#view of the dataset
share_of_women_inventors.head()

     Country  Year        Unit  Share of Women Inventors (%)
0  Argentina  1996  Percentage                          10.7
1  Argentina  1997  Percentage                           8.6
2  Argentina  1998  Percentage                           9.4
3  Argentina  1999  Percentage                          12.9
4  Argentina  2000  Percentage                          16.4

To clarity, GPI Ratio of female to male net enrolment ratio for tertiary education. It is calculated by dividing the female value for the indicator by the male value for the indicator. A GPI of 1 indicates parity between females and males. A value less than 1 indicates disparity in favor of males and a value greater than 1 indicates disparity in favor of females.

In [3]:
#size of the dataset
share_of_women_inventors.shape

(1074, 4)

In [4]:
#create a list of desired OECD countries
countries = set(
    [
        "Australia",
        "Austria",
        "Belgium",
        "Canada",
        "Chile",
        "Colombia",
        "Denmark",
        "Finland",
        "France",
        "Germany",
        "Greece",
        "Hungary",
        "Iceland",
        "Ireland",
        "Israel",
        "Italy",
        "Japan",
        "Lithuania",
        "Luxembourg",
        "Mexico",
        "Netherlands",
        "New Zealand",
        "Norway",
        "Poland",
        "Portugal",
        "Slovakia",
        "Slovenia",
        "Spain",
        "Sweden",
        "Switzerland",
        "Turkey",
        "United Kingdom",
        "United States",
    ]
)

In [5]:
#filter out the desired countries in the dataset
share_of_women_inventors_1 = share_of_women_inventors.loc[share_of_women_inventors.Country.isin(countries)]

#reset index
share_of_women_inventors_1.reset_index(drop='True')

           Country  Year        Unit  Share of Women Inventors (%)
0        Australia  1985  Percentage                           4.4
1        Australia  1986  Percentage                           4.7
2        Australia  1987  Percentage                           5.7
3        Australia  1988  Percentage                           6.0
4        Australia  1989  Percentage                           6.5
..             ...   ...         ...                           ...
913  United States  2013  Percentage                          12.1
914  United States  2014  Percentage                          12.1
915  United States  2015  Percentage                          12.1
916  United States  2016  Percentage                          11.9
917  United States  2017  Percentage                          11.8

[918 rows x 4 columns]

In [6]:
years = set(
    [
        "2010",
        "2011",
        "2012",
        "2013",
        "2014",
    ]
)

In [7]:
#filter out the desired countries in the dataset
share_of_women_inventors_final = share_of_women_inventors_1.loc[share_of_women_inventors_1.Year.astype(str).isin(years)]

In [8]:
#view of cleaned dataset
share_of_women_inventors_final.head()

#reset index
share_of_women_inventors_final.reset_index(drop='True')

           Country  Year        Unit  Share of Women Inventors (%)
0        Australia  2010  Percentage                          10.7
1        Australia  2011  Percentage                          11.0
2        Australia  2012  Percentage                          11.1
3        Australia  2013  Percentage                          11.4
4        Australia  2014  Percentage                          11.5
..             ...   ...         ...                           ...
160  United States  2010  Percentage                          11.7
161  United States  2011  Percentage                          11.7
162  United States  2012  Percentage                          11.8
163  United States  2013  Percentage                          12.1
164  United States  2014  Percentage                          12.1

[165 rows x 4 columns]

In [9]:
#size of the cleaned dataset
share_of_women_inventors_final.shape

(165, 4)

## 2. Dataset: Education Factors

In [10]:
#load raw dataset of GPI enrollment ratio of tertiary education (women to men)
gpi = pd.read_csv("gpi-tertiary-education.csv")

#get rid of undesired columns
gpi = gpi.drop(columns=['Code'])

#view of the dataset
gpi.head()

,Country,Year,"Gross enrolment ratio, tertiary, gender parity index (GPI)"
0,Afghanistan,1970,0.16565
1,Afghanistan,1972,0.15370
2,Afghanistan,1973,0.18578
3,Afghanistan,1974,0.16274
4,Afghanistan,1975,0.16533

In [11]:
#size of the dataset
gpi.shape

(5382, 3)

In [12]:
#filter out the desired countries in the dataset
gpi_1 = gpi.loc[gpi.Country.isin(countries)]

In [13]:
#filter out the desired countries in the dataset
gpi_final = gpi_1.loc[gpi_1.Year.astype(str).isin(years)]

In [14]:
#view of cleaned dataset
gpi_final.head()

#reset index
gpi_final.reset_index(drop='True')

,Country,Year,"Gross enrolment ratio, tertiary, gender parity index (GPI)"
0,Australia,2010,1.38099
1,Australia,2011,1.39396
2,Australia,2012,1.40529
3,Australia,2013,1.40312
4,Australia,2014,1.40312
...,...,...,...
160,United States,2010,1.40825
161,United States,2011,1.40311
162,United States,2012,1.40738
163,United States,2013,1.38494
164,United States,2014,1.37069

In [15]:
#view of cleaned dataset
gpi_final.head()

#reset index
gpi_final.reset_index(drop='True')

,Country,Year,"Gross enrolment ratio, tertiary, gender parity index (GPI)"
0,Australia,2010,1.38099
1,Australia,2011,1.39396
2,Australia,2012,1.40529
3,Australia,2013,1.40312
4,Australia,2014,1.40312
...,...,...,...
160,United States,2010,1.40825
161,United States,2011,1.40311
162,United States,2012,1.40738
163,United States,2013,1.38494
164,United States,2014,1.37069

In [16]:
#size of the cleaned dataset
gpi_final.shape

(165, 3)

In [17]:
#load raw dataset of Percentage of Women in Science and Tech majors
sci_tech_women = pd.read_csv("share-graduates-stem-female.csv")

#get rid of undesired columns
sci_tech_women = sci_tech_women.drop(columns=['Code'])

#view of the dataset
sci_tech_women.head()

,Country,Year,Percentage of graduates from Science and Technology programmes in tertiary education who are female (%)
0,Afghanistan,2014,10.632770
1,Albania,2000,29.968451
2,Albania,2003,44.200630
3,Albania,2011,48.064209
4,Albania,2013,52.198551

In [18]:
#size of the dataset
sci_tech_women.shape

(1100, 3)

In [19]:
#filter out the desired countries in the dataset
sci_tech_women_1 = sci_tech_women.loc[sci_tech_women.Country.isin(countries)]

In [20]:
#filter out the desired countries in the dataset
sci_tech_women_final = sci_tech_women_1.loc[sci_tech_women_1.Year.astype(str).isin(years)]

In [21]:
#view of cleaned dataset
sci_tech_women_final.head()

#reset index
sci_tech_women_final.reset_index(drop='True')

,Country,Year,Percentage of graduates from Science and Technology programmes in tertiary education who are female (%)
0,Australia,2010,29.322420
1,Australia,2011,29.104170
2,Australia,2012,NaN
3,Australia,2013,NaN
4,Australia,2014,29.765360
...,...,...,...
160,United States,2010,30.906891
161,United States,2011,30.387581
162,United States,2012,30.390720
163,United States,2013,31.001530
164,United States,2014,31.256451

In [22]:
#size of the cleaned dataset
sci_tech_women_final.shape

(165, 3)

## 3. Dataset: Social Resource Factors

In [23]:
#load data
access_women = pd.read_csv("Access_to_training_and_money_to_start_a_business_by_sex.csv")

#get rid of undesired data
access_women = access_women.drop(columns=['LOCATION','INDICATOR','SEX','AGE','Age','TIME','Unit Code','Unit','PowerCode Code','PowerCode','Reference Period Code','Reference Period','Flag Codes','Flags'])

#view of the dataset
access_women.head()

,Country,Indicator,Sex,Time,Value
0,Australia,Access to training on how to start a business,Women,2013,67.871
1,Australia,Access to money to start a business,Women,2013,41.324
2,Australia,Access to training on how to start a business,Men,2013,65.745
3,Australia,Access to money to start a business,Men,2013,57.703
4,Austria,Access to training on how to start a business,Women,2013,61.505

In [24]:
#view size of datasize
access_women.shape

(152, 5)

In [25]:
#get rid of men access
access_training_women = access_women.loc[(access_women['Indicator']=='Access to training on how to start a business') & (access_women['Sex']=='Women')]

#view of dataset
access_training_women.head()

,Country,Indicator,Sex,Time,Value
0,Australia,Access to training on how to start a business,Women,2013,67.871
4,Austria,Access to training on how to start a business,Women,2013,61.505
9,Belgium,Access to training on how to start a business,Women,2013,43.878
13,Brazil,Access to training on how to start a business,Women,2013,20.995
16,Canada,Access to training on how to start a business,Women,2013,64.711

In [26]:
#size of the new dataset
access_training_women.shape

(38, 5)

In [27]:
#clean and rename columns
access_training_women_final = access_training_women.loc[access_training_women.Country.isin(countries)].reset_index()
access_training_women_final = access_training_women_final.drop(columns=['index'])

access_training_women_final.rename(columns={'Value':'Percentage of women declaring that they have access to training on how to start a business (%)'}, inplace=True)
access_training_women_final.rename(columns={'Time':'Year'}, inplace=True)
access_training_women_final = access_training_women_final.drop(columns=['Sex','Indicator'])

#view of dataset
access_training_women_final.head()

,Country,Year,Percentage of women declaring that they have access to training on how to start a business (%)
0,Australia,2013,67.871
1,Austria,2013,61.505
2,Belgium,2013,43.878
3,Canada,2013,64.711
4,Chile,2013,29.034

In [28]:
#size of the dataset
access_training_women_final.shape

(28, 3)

In [29]:
#get rid of men stats
access_money_women = access_women.loc[(access_women['Indicator']=='Access to money to start a business') & (access_women['Sex']=='Women')]

#view of dataset
access_money_women.head()

      Country                            Indicator    Sex  Time   Value
1   Australia  Access to money to start a business  Women  2013  41.324
5     Austria  Access to money to start a business  Women  2013  48.044
8     Belgium  Access to money to start a business  Women  2013  32.129
12     Brazil  Access to money to start a business  Women  2013  16.677
17     Canada  Access to money to start a business  Women  2013  49.541

In [30]:
#size of the dataset
access_money_women.shape

(38, 5)

In [31]:
#clean and rename columns
access_money_women_final = access_money_women.loc[access_money_women.Country.isin(countries)].reset_index()
access_money_women_final = access_money_women_final.drop(columns=['index'])

access_money_women_final.rename(columns={'Value':'Percentage of women declaring that they have access to money to start a business (%)'}, inplace=True)
access_money_women_final.rename(columns={'Time':'Year'}, inplace=True)
access_money_women_final = access_money_women_final.drop(columns=['Sex','Indicator'])

#size of the dataset
access_money_women_final.head()

,Country,Year,Percentage of women declaring that they have access to money to start a business (%)
0,Australia,2013,41.324
1,Austria,2013,48.044
2,Belgium,2013,32.129
3,Canada,2013,49.541
4,Chile,2013,18.017

In [32]:
#size of the dataset
access_money_women_final.shape

(28, 3)

## 4. Dataset: Attitude Factor

In [33]:
#load data
attitude_risk_women = pd.read_csv("Attitude_towards_entrepreneurial_risk_by_sex.csv")

#get rid of undesired data
attitude_risk_women = attitude_risk_women.drop(columns=['LOCATION','INDICATOR','SEX','AGE','Age','TIME','Unit Code','Unit','PowerCode Code','PowerCode','Reference Period Code','Reference Period','Flag Codes','Flags'])

#view of the dataset
attitude_risk_women.head()

     Country                              Indicator    Sex  Time   Value
0  Australia  Attitude towards entrepreneurial risk  Women  2013  45.305
1  Australia  Attitude towards entrepreneurial risk    Men  2013  53.772
2    Austria  Attitude towards entrepreneurial risk  Women  2013  23.726
3    Austria  Attitude towards entrepreneurial risk    Men  2013  39.002
4    Belgium  Attitude towards entrepreneurial risk  Women  2013  31.192

In [34]:
#size of the dataset
attitude_risk_women.shape

(76, 5)

In [35]:
#get rid of men attitudes
attitude_risk_women = attitude_risk_women.loc[(attitude_risk_women['Indicator']=='Attitude towards entrepreneurial risk') & (attitude_risk_women['Sex']=='Women')]

#view of the dataset
attitude_risk_women.head()

     Country                              Indicator    Sex  Time   Value
0  Australia  Attitude towards entrepreneurial risk  Women  2013  45.305
2    Austria  Attitude towards entrepreneurial risk  Women  2013  23.726
4    Belgium  Attitude towards entrepreneurial risk  Women  2013  31.192
6     Brazil  Attitude towards entrepreneurial risk  Women  2013  59.766
8     Canada  Attitude towards entrepreneurial risk  Women  2013  56.682

In [36]:
#size of the dataset
attitude_risk_women.shape

(38, 5)

In [37]:
#clean and rename columns
attitude_risk_women_final = attitude_risk_women.loc[attitude_risk_women.Country.isin(countries)].reset_index()
attitude_risk_women_final = attitude_risk_women_final.drop(columns=['index'])

attitude_risk_women_final.rename(columns={'Value':'Percentage of women prefering taking a risk and starting a new business to working for someone else (%)'}, inplace=True)
attitude_risk_women_final.rename(columns={'Time':'Year'}, inplace=True)
attitude_risk_women_final = attitude_risk_women_final.drop(columns=['Sex','Indicator'])

#view of the dataset
attitude_risk_women_final.head()

,Country,Year,Percentage of women prefering taking a risk and starting a new business to working for someone else (%)
0,Australia,2013,45.305
1,Austria,2013,23.726
2,Belgium,2013,31.192
3,Canada,2013,56.682
4,Chile,2013,70.783

In [38]:
#size of the dataset
attitude_risk_women_final.shape

(28, 3)

# Dataset Merge

In [39]:
#merge datasets of education factors
education = pd.merge(gpi_final, sci_tech_women_final,how='outer')

#view of the new dataset
education.head(165)

,Country,Year,"Gross enrolment ratio, tertiary, gender parity index (GPI)",Percentage of graduates from Science and Technology programmes in tertiary education who are female (%)
0,Australia,2010,1.38099,29.322420
1,Australia,2011,1.39396,29.104170
2,Australia,2012,1.40529,NaN
3,Australia,2013,1.40312,NaN
4,Australia,2014,1.40312,29.765360
...,...,...,...,...
160,United States,2010,1.40825,30.906891
161,United States,2011,1.40311,30.387581
162,United States,2012,1.40738,30.390720
163,United States,2013,1.38494,31.001530
164,United States,2014,1.37069,31.256451

In [40]:
#size of the new dataset
education.shape

(165, 4)

In [41]:
#merge datasets of education factors
result = pd.merge(share_of_women_inventors_final, education, on=['Year','Country'])

#view of new dataset
result.head()

,Country,Year,Unit,Share of Women Inventors (%),"Gross enrolment ratio, tertiary, gender parity index (GPI)",Percentage of graduates from Science and Technology programmes in tertiary education who are female (%)
0,Australia,2010,Percentage,10.7,1.38099,29.32242
1,Australia,2011,Percentage,11.0,1.39396,29.10417
2,Australia,2012,Percentage,11.1,1.40529,NaN
3,Australia,2013,Percentage,11.4,1.40312,NaN
4,Australia,2014,Percentage,11.5,1.40312,29.76536

In [42]:
result.shape

(165, 6)

In [43]:
#merge datasets of employment factors with the above merged dataset
final = pd.merge(result, access_training_women_final, on=['Country'], how='left', suffixes=('', '_y'))

final = final.drop(columns=['Year_y','Unit'])

#view of new dataset
final.head()

,Country,Year,Share of Women Inventors (%),"Gross enrolment ratio, tertiary, gender parity index (GPI)",Percentage of graduates from Science and Technology programmes in tertiary education who are female (%),Percentage of women declaring that they have access to training on how to start a business (%)
0,Australia,2010,10.7,1.38099,29.32242,67.871
1,Australia,2011,11.0,1.39396,29.10417,67.871
2,Australia,2012,11.1,1.40529,NaN,67.871
3,Australia,2013,11.4,1.40312,NaN,67.871
4,Australia,2014,11.5,1.40312,29.76536,67.871

In [44]:
#size of the new dataset
final.shape

(165, 6)

In [45]:
#merge datasets of employment factors with the above merged dataset
final = pd.merge(final, access_money_women_final, on=['Country'], how='left', suffixes=('', '_y'))

final = final.drop(columns=['Year_y'])

#view of new dataset
final.head()

,Country,Year,Share of Women Inventors (%),"Gross enrolment ratio, tertiary, gender parity index (GPI)",Percentage of graduates from Science and Technology programmes in tertiary education who are female (%),Percentage of women declaring that they have access to training on how to start a business (%),Percentage of women declaring that they have access to money to start a business (%)
0,Australia,2010,10.7,1.38099,29.32242,67.871,41.324
1,Australia,2011,11.0,1.39396,29.10417,67.871,41.324
2,Australia,2012,11.1,1.40529,NaN,67.871,41.324
3,Australia,2013,11.4,1.40312,NaN,67.871,41.324
4,Australia,2014,11.5,1.40312,29.76536,67.871,41.324

In [46]:
#size of the new dataset
final.shape

(165, 7)

In [47]:
#merge datasets of employment factors with the above merged dataset
final = pd.merge(final, attitude_risk_women_final, on=['Country'], how='left', suffixes=('', '_y'))

final = final.drop(columns=['Year_y'])

#view of new dataset
final.head(30)

,Country,Year,Share of Women Inventors (%),"Gross enrolment ratio, tertiary, gender parity index (GPI)",Percentage of graduates from Science and Technology programmes in tertiary education who are female (%),Percentage of women declaring that they have access to training on how to start a business (%),Percentage of women declaring that they have access to money to start a business (%),Percentage of women prefering taking a risk and starting a new business to working for someone else (%)
0,Australia,2010,10.700000,1.38099,29.322420,67.871,41.324,45.305
1,Australia,2011,11.000000,1.39396,29.104170,67.871,41.324,45.305
2,Australia,2012,11.100000,1.40529,NaN,67.871,41.324,45.305
3,Australia,2013,11.400000,1.40312,NaN,67.871,41.324,45.305
4,Australia,2014,11.500000,1.40312,29.765360,67.871,41.324,45.305
5,Austria,2010,5.600000,1.17002,23.489010,61.505,48.044,23.726
6,Austria,2011,5.400000,1.18257,25.145361,61.505,48.044,23.726
7,Austria,2012,5.400000,1.19864,25.540199,61.505,48.044,23.726
8,Austria,2013,5.400000,1.20621,25.146490,61.505,48.044,23.726
9,Austria,2014,5.600000,1.20348,25.482410,61.505,48.044,23.726
10,Belgium,2010,14.200000,1.26629,23.994690,43.878,32.129,31.192
11,Belgium,2011,13.400000,1.27273,24.672409,43.878,32.129,31.192
12,Belgium,2012,12.700000,1.28718,24.200029,43.878,32.129,31.192
13,Belgium,2013,11.700000,1.30132,24.546341,43.878,32.129,31.192
14,Belgium,2014,12.500000,1.31026,NaN,43.878,32.129,31.192
15,Canada,2010,12.100000,NaN,NaN,64.711,49.541,56.682
16,Canada,2011,11.900000,NaN,NaN,64.711,49.541,56.682
17,Canada,2012,11.900000,NaN,NaN,64.711,49.541,56.682
18,Canada,2013,12.200000,NaN,NaN,64.711,49.541,56.682
19,Canada,2014,12.200000,NaN,NaN,64.711,49.541,56.682
20,Chile,2010,23.600000,1.07766,19.495939,29.034,18.017,70.783
21,Chile,2011,24.799999,1.10703,NaN,29.034,18.017,70.783
22,Chile,2012,20.299999,1.13002,19.328140,29.034,18.017,70.783
23,Chile,2013,21.600000,1.12747,NaN,29.034,18.017,70.783
24,Chile,2014,21.400000,1.13570,18.244160,29.034,18.017,70.783
25,Colombia,2010,11.100000,1.09840,NaN,NaN,NaN,NaN
26,Colombia,2011,13.400000,1.09874,34.281250,NaN,NaN,NaN
27,Colombia,2012,17.900000,1.12918,33.865292,NaN,NaN,NaN
28,Colombia,2013,23.799999,1.14547,33.995720,NaN,NaN,NaN
29,Colombia,2014,26.299999,1.14540,33.711849,NaN,NaN,NaN

In [48]:
#size of the new dataset
final.shape

(165, 8)

In [49]:
final.to_csv(r'C:\Users\jiang\INFO 2950\final.csv', index=False)